tutorials/rheoMultiRegionFoam/sphere/PTTLog/0/fluid/theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform ( 0 0 0 0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }
     
    walls
    {
       type           zeroGradient;     
    }
    
    map.fluid
    {
        type            zeroGradient;
     
    }
    
    "(front|back)"
    {
        type          wedge;
    }
}

// ************************************************************************* //
